INERIStest14_casefile/0/epsilon.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.5e-4;

boundaryField
{
    sideLeft
    {
        type            symmetryPlane; //zeroGradient;
    }

    sideRight
    {
        type            fixedValue;
        value           $internalField;
    }
    topbottom
    {
    	type            empty;  
    }
    frontback
    {
    	type            empty;  
    }    
    //defaultFaces
    //{
        //type            empty;
    //}
}

// ************************************************************************* //
